origin_redis/redis/bench-results/fs_redis_fdp_disabled_always/summary_5.txt
====== SET ======
  28835840 requests completed in 1540.92 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": yes
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.631 milliseconds (cumulative count 1)
50.000% <= 2.167 milliseconds (cumulative count 14452967)
75.000% <= 2.479 milliseconds (cumulative count 21688168)
87.500% <= 2.839 milliseconds (cumulative count 25246095)
93.750% <= 3.255 milliseconds (cumulative count 27045510)
96.875% <= 3.887 milliseconds (cumulative count 27936008)
98.438% <= 4.607 milliseconds (cumulative count 28387504)
99.219% <= 5.391 milliseconds (cumulative count 28611153)
99.609% <= 6.095 milliseconds (cumulative count 28723869)
99.805% <= 6.887 milliseconds (cumulative count 28779526)
99.902% <= 7.823 milliseconds (cumulative count 28807693)
99.951% <= 9.063 milliseconds (cumulative count 28821770)
99.976% <= 12.175 milliseconds (cumulative count 28828802)
99.988% <= 325.375 milliseconds (cumulative count 28832320)
99.994% <= 2314.239 milliseconds (cumulative count 28834140)
99.997% <= 2332.671 milliseconds (cumulative count 28835037)
99.998% <= 2363.391 milliseconds (cumulative count 28835421)
99.999% <= 2402.303 milliseconds (cumulative count 28835626)
100.000% <= 4808.703 milliseconds (cumulative count 28835740)
100.000% <= 9994.239 milliseconds (cumulative count 28835790)
100.000% <= 10002.431 milliseconds (cumulative count 28835840)
100.000% <= 10002.431 milliseconds (cumulative count 28835840)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 0.703 milliseconds (cumulative count 1)
0.000% <= 0.807 milliseconds (cumulative count 20)
0.000% <= 0.903 milliseconds (cumulative count 128)
0.004% <= 1.007 milliseconds (cumulative count 1178)
0.024% <= 1.103 milliseconds (cumulative count 6972)
0.374% <= 1.207 milliseconds (cumulative count 107904)
4.715% <= 1.303 milliseconds (cumulative count 1359670)
8.968% <= 1.407 milliseconds (cumulative count 2586063)
14.327% <= 1.503 milliseconds (cumulative count 4131223)
16.849% <= 1.607 milliseconds (cumulative count 4858547)
18.420% <= 1.703 milliseconds (cumulative count 5311569)
20.094% <= 1.807 milliseconds (cumulative count 5794388)
24.511% <= 1.903 milliseconds (cumulative count 7067914)
32.658% <= 2.007 milliseconds (cumulative count 9417119)
43.066% <= 2.103 milliseconds (cumulative count 12418503)
92.154% <= 3.103 milliseconds (cumulative count 26573523)
97.462% <= 4.103 milliseconds (cumulative count 28103921)
98.988% <= 5.103 milliseconds (cumulative count 28543974)
99.615% <= 6.103 milliseconds (cumulative count 28724743)
99.836% <= 7.103 milliseconds (cumulative count 28788435)
99.919% <= 8.103 milliseconds (cumulative count 28812340)
99.952% <= 9.103 milliseconds (cumulative count 28822030)
99.967% <= 10.103 milliseconds (cumulative count 28826236)
99.972% <= 11.103 milliseconds (cumulative count 28827667)
99.975% <= 12.103 milliseconds (cumulative count 28828741)
99.977% <= 13.103 milliseconds (cumulative count 28829340)
99.979% <= 14.103 milliseconds (cumulative count 28829643)
99.979% <= 15.103 milliseconds (cumulative count 28829904)
99.980% <= 16.103 milliseconds (cumulative count 28830179)
99.981% <= 17.103 milliseconds (cumulative count 28830291)
99.981% <= 18.111 milliseconds (cumulative count 28830328)
99.981% <= 19.103 milliseconds (cumulative count 28830451)
99.982% <= 20.111 milliseconds (cumulative count 28830543)
99.982% <= 21.103 milliseconds (cumulative count 28830554)
99.982% <= 22.111 milliseconds (cumulative count 28830592)
99.982% <= 23.103 milliseconds (cumulative count 28830703)
99.983% <= 24.111 milliseconds (cumulative count 28830883)
99.983% <= 25.103 milliseconds (cumulative count 28831010)
99.984% <= 26.111 milliseconds (cumulative count 28831112)
99.984% <= 27.103 milliseconds (cumulative count 28831169)
99.984% <= 28.111 milliseconds (cumulative count 28831176)
99.984% <= 29.103 milliseconds (cumulative count 28831215)
99.984% <= 30.111 milliseconds (cumulative count 28831225)
99.984% <= 31.103 milliseconds (cumulative count 28831246)
99.984% <= 32.111 milliseconds (cumulative count 28831283)
99.984% <= 33.119 milliseconds (cumulative count 28831331)
99.985% <= 34.111 milliseconds (cumulative count 28831394)
99.985% <= 35.103 milliseconds (cumulative count 28831417)
99.985% <= 36.127 milliseconds (cumulative count 28831491)
99.985% <= 37.119 milliseconds (cumulative count 28831544)
99.985% <= 38.111 milliseconds (cumulative count 28831611)
99.985% <= 39.103 milliseconds (cumulative count 28831634)
99.985% <= 40.127 milliseconds (cumulative count 28831636)
99.986% <= 41.119 milliseconds (cumulative count 28831673)
99.986% <= 42.111 milliseconds (cumulative count 28831731)
99.986% <= 43.103 milliseconds (cumulative count 28831745)
99.986% <= 50.111 milliseconds (cumulative count 28831766)
99.986% <= 51.103 milliseconds (cumulative count 28831825)
99.986% <= 52.127 milliseconds (cumulative count 28831851)
99.986% <= 53.119 milliseconds (cumulative count 28831852)
99.986% <= 55.103 milliseconds (cumulative count 28831855)
99.986% <= 56.127 milliseconds (cumulative count 28831873)
99.986% <= 57.119 milliseconds (cumulative count 28831879)
99.986% <= 59.103 milliseconds (cumulative count 28831888)
99.986% <= 60.127 milliseconds (cumulative count 28831906)
99.986% <= 61.119 milliseconds (cumulative count 28831909)
99.986% <= 63.103 milliseconds (cumulative count 28831914)
99.986% <= 64.127 milliseconds (cumulative count 28831938)
99.987% <= 67.135 milliseconds (cumulative count 28831959)
99.987% <= 69.119 milliseconds (cumulative count 28831963)
99.987% <= 70.143 milliseconds (cumulative count 28831983)
99.987% <= 71.103 milliseconds (cumulative count 28831986)
99.987% <= 76.159 milliseconds (cumulative count 28831992)
99.987% <= 77.119 milliseconds (cumulative count 28832014)
99.987% <= 78.143 milliseconds (cumulative count 28832031)
99.987% <= 79.103 milliseconds (cumulative count 28832036)
99.987% <= 100.159 milliseconds (cumulative count 28832054)
99.987% <= 101.119 milliseconds (cumulative count 28832062)
99.987% <= 107.135 milliseconds (cumulative count 28832065)
99.987% <= 120.127 milliseconds (cumulative count 28832075)
99.987% <= 125.119 milliseconds (cumulative count 28832078)
99.987% <= 128.127 milliseconds (cumulative count 28832094)
99.987% <= 129.151 milliseconds (cumulative count 28832107)
99.987% <= 162.175 milliseconds (cumulative count 28832111)
99.987% <= 165.119 milliseconds (cumulative count 28832116)
99.987% <= 172.159 milliseconds (cumulative count 28832131)
99.987% <= 173.183 milliseconds (cumulative count 28832135)
99.987% <= 190.207 milliseconds (cumulative count 28832155)
99.987% <= 191.103 milliseconds (cumulative count 28832162)
99.987% <= 206.207 milliseconds (cumulative count 28832183)
99.987% <= 207.103 milliseconds (cumulative count 28832190)
99.987% <= 211.199 milliseconds (cumulative count 28832193)
99.987% <= 213.119 milliseconds (cumulative count 28832195)
99.987% <= 220.159 milliseconds (cumulative count 28832199)
99.987% <= 226.175 milliseconds (cumulative count 28832204)
99.987% <= 229.119 milliseconds (cumulative count 28832226)
99.987% <= 230.143 milliseconds (cumulative count 28832232)
99.988% <= 242.175 milliseconds (cumulative count 28832246)
99.988% <= 243.199 milliseconds (cumulative count 28832254)
99.988% <= 252.159 milliseconds (cumulative count 28832270)
99.988% <= 253.183 milliseconds (cumulative count 28832276)
99.988% <= 270.335 milliseconds (cumulative count 28832282)
99.988% <= 271.103 milliseconds (cumulative count 28832297)
99.988% <= 272.127 milliseconds (cumulative count 28832304)
99.988% <= 324.351 milliseconds (cumulative count 28832307)
99.988% <= 325.119 milliseconds (cumulative count 28832314)
99.988% <= 326.143 milliseconds (cumulative count 28832331)
99.988% <= 329.215 milliseconds (cumulative count 28832348)
99.988% <= 331.263 milliseconds (cumulative count 28832367)
99.988% <= 332.287 milliseconds (cumulative count 28832370)
99.988% <= 336.127 milliseconds (cumulative count 28832385)
99.988% <= 337.151 milliseconds (cumulative count 28832388)
99.988% <= 343.295 milliseconds (cumulative count 28832389)
99.988% <= 344.319 milliseconds (cumulative count 28832409)
99.988% <= 345.343 milliseconds (cumulative count 28832411)
99.988% <= 383.231 milliseconds (cumulative count 28832418)
99.988% <= 384.255 milliseconds (cumulative count 28832429)
99.988% <= 421.119 milliseconds (cumulative count 28832434)
99.988% <= 422.143 milliseconds (cumulative count 28832452)
99.988% <= 423.167 milliseconds (cumulative count 28832459)
99.988% <= 540.159 milliseconds (cumulative count 28832483)
99.988% <= 541.183 milliseconds (cumulative count 28832499)
99.988% <= 542.207 milliseconds (cumulative count 28832509)
99.988% <= 565.247 milliseconds (cumulative count 28832518)
99.989% <= 566.271 milliseconds (cumulative count 28832537)
99.989% <= 573.439 milliseconds (cumulative count 28832553)
99.989% <= 574.463 milliseconds (cumulative count 28832559)
99.989% <= 724.479 milliseconds (cumulative count 28832562)
99.989% <= 725.503 milliseconds (cumulative count 28832584)
99.989% <= 726.527 milliseconds (cumulative count 28832585)
99.989% <= 727.551 milliseconds (cumulative count 28832607)
99.989% <= 728.575 milliseconds (cumulative count 28832609)
99.989% <= 1530.879 milliseconds (cumulative count 28832614)
99.989% <= 1531.903 milliseconds (cumulative count 28832636)
99.989% <= 1545.215 milliseconds (cumulative count 28832659)
99.989% <= 1858.559 milliseconds (cumulative count 28832666)
99.989% <= 1859.583 milliseconds (cumulative count 28832687)
99.989% <= 1883.135 milliseconds (cumulative count 28832709)
99.989% <= 2134.015 milliseconds (cumulative count 28832714)
99.989% <= 2136.063 milliseconds (cumulative count 28832736)
99.989% <= 2222.079 milliseconds (cumulative count 28832763)
99.989% <= 2236.415 milliseconds (cumulative count 28832778)
99.989% <= 2238.463 milliseconds (cumulative count 28832789)
99.990% <= 2244.607 milliseconds (cumulative count 28832815)
99.990% <= 2256.895 milliseconds (cumulative count 28832844)
99.990% <= 2269.183 milliseconds (cumulative count 28832846)
99.990% <= 2271.231 milliseconds (cumulative count 28832918)
99.990% <= 2277.375 milliseconds (cumulative count 28832945)
99.990% <= 2281.471 milliseconds (cumulative count 28832973)
99.990% <= 2285.567 milliseconds (cumulative count 28832997)
99.990% <= 2287.615 milliseconds (cumulative count 28833002)
99.990% <= 2289.663 milliseconds (cumulative count 28833028)
99.990% <= 2291.711 milliseconds (cumulative count 28833087)
99.991% <= 2293.759 milliseconds (cumulative count 28833110)
99.991% <= 2295.807 milliseconds (cumulative count 28833212)
99.991% <= 2297.855 milliseconds (cumulative count 28833246)
99.991% <= 2299.903 milliseconds (cumulative count 28833247)
99.991% <= 2301.951 milliseconds (cumulative count 28833292)
99.992% <= 2303.999 milliseconds (cumulative count 28833493)
99.992% <= 2306.047 milliseconds (cumulative count 28833597)
99.993% <= 2308.095 milliseconds (cumulative count 28833788)
99.993% <= 2310.143 milliseconds (cumulative count 28833909)
99.994% <= 2312.191 milliseconds (cumulative count 28833984)
99.994% <= 2314.239 milliseconds (cumulative count 28834140)
99.994% <= 2316.287 milliseconds (cumulative count 28834208)
99.995% <= 2318.335 milliseconds (cumulative count 28834319)
99.995% <= 2320.383 milliseconds (cumulative count 28834487)
99.996% <= 2322.431 milliseconds (cumulative count 28834633)
99.996% <= 2324.479 milliseconds (cumulative count 28834689)
99.996% <= 2326.527 milliseconds (cumulative count 28834765)
99.996% <= 2328.575 milliseconds (cumulative count 28834766)
99.997% <= 2330.623 milliseconds (cumulative count 28834857)
99.997% <= 2332.671 milliseconds (cumulative count 28835037)
99.998% <= 2334.719 milliseconds (cumulative count 28835178)
99.998% <= 2336.767 milliseconds (cumulative count 28835235)
99.998% <= 2338.815 milliseconds (cumulative count 28835261)
99.998% <= 2340.863 milliseconds (cumulative count 28835312)
99.998% <= 2342.911 milliseconds (cumulative count 28835328)
99.998% <= 2349.055 milliseconds (cumulative count 28835333)
99.998% <= 2351.103 milliseconds (cumulative count 28835353)
99.998% <= 2353.151 milliseconds (cumulative count 28835379)
99.999% <= 2363.391 milliseconds (cumulative count 28835421)
99.999% <= 2365.439 milliseconds (cumulative count 28835422)
99.999% <= 2369.535 milliseconds (cumulative count 28835445)
99.999% <= 2373.631 milliseconds (cumulative count 28835469)
99.999% <= 2375.679 milliseconds (cumulative count 28835495)
99.999% <= 2379.775 milliseconds (cumulative count 28835520)
99.999% <= 2381.823 milliseconds (cumulative count 28835545)
99.999% <= 2392.063 milliseconds (cumulative count 28835575)
99.999% <= 2394.111 milliseconds (cumulative count 28835595)
99.999% <= 2402.303 milliseconds (cumulative count 28835626)
99.999% <= 2404.351 milliseconds (cumulative count 28835645)
99.999% <= 2496.511 milliseconds (cumulative count 28835655)
99.999% <= 2498.559 milliseconds (cumulative count 28835671)
99.999% <= 4599.807 milliseconds (cumulative count 28835692)
100.000% <= 4603.903 milliseconds (cumulative count 28835716)
100.000% <= 4808.703 milliseconds (cumulative count 28835740)
100.000% <= 9887.743 milliseconds (cumulative count 28835765)
100.000% <= 9994.239 milliseconds (cumulative count 28835790)
100.000% <= 10002.431 milliseconds (cumulative count 28835840)
100.000% <= 10002.431 milliseconds (cumulative count 28835840)
100.000% <= 10002.431 milliseconds (cumulative count 28835840)
[...]

Summary:
  throughput summary: 18713.43 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        2.548     0.624     2.167     3.415     5.119 10002.431